/*
	118p~122p 연습문제 1~11,14~15

	1.	1. C 언어
		2. 200+300
		3. 500

	2.	1. 100 200 300
		2. 100 200
		3. 100

	3.	3번

	4.	1. 실수 => %f
		2. 16진수 정수=> %x
		3. 문자열 => %c
		4. 8진수 정수 => %o

	5.	4번

	6.	1. \a
		2. \r
		3. \t
		4. \'

	7.	4번

	8.	a = b = c = 10;

	9. 1번 0001 0000

	10. unsigned long

	11. 다맞는거 같은데..

	12. 4번 인덱스가 0,1,2만 있음.

	13.	for (int i = 0; i < 9; i += 2) {
		printf("%c", str[i]);
		}

	14.	1.	f111
			111+222
			333
		2.	0123.450
		3.	123.00

	15.	1.	a의 값 = = > 111.22
			b의 값 = = > 300.000000

		2.	K를 소문자로 표시하면 k이며
			z를 대문자로 표시하면 Z이며
	

	154p~158p 연습문제 1~6,8~12 풀어오기

	1.	1.	13
		2.	30
		3.	3
		4.	1

	2.	1.	17.000000
		2.	60.000000
		3.	3.000000

	3.	4번

	4.	3번

	5.	1,4번

	6.	2, 4번

	8.	() ++ >> += && ?:

	9.	2.00 + 3.00 = 9.00
		2.00 - 3.00 = -5.00
		2.00 * 3.00 = 24.00

	10.	#include <stdio.h>

		int main()
		{
		int money,5man, man, 5chun, chun,change;

		printf(" ## 지폐로 교환할 돈은 ? ");
		scanf("%d", &money);

		5man = money / 50000;
		money %= 50000;

		man = money / 10000;
		money %= 10000;

		 5chun = money / 5000;
		money %= 5000;

		chun = money / 1000;
		money %= 1000;

		change = money;

		printf("오만 원짜리==> %d장\n", 5man);
		printf("만 원짜리==> %d장\n", man);
		printf("오천 원짜리==> %d장\n", 5chun);
		printf("천 원짜리==> %d장\n", chun);
		printf("지폐로 바꾸지 못한 잔돈 ==> %d원\n",change);

		return 0;

		}

	11.	101
		101
		101

	12. a==100
*/


